# 首先是模数的阶

"""
定义:
    设m>0, (a, m) = 1, 使得a^l === 1(mod m) 成立的最小正整数l为a的对模数m的阶, 记为ord(下标为m)(a), 有时在模数m
    不变的时候, 也简记为ord(a)

性质:
    1、如果a === a'(mod m), 则ord(a) = ord(a')
    2、a^n === 1(mod m)的充要条件是ord(a) | n, 从而ord(a) | Oula(m)
    3、ord(a) = l, 则1, a, a^2, a^3, ..., a^(l-1)对模数m两两不同余
    4、ord(a) = l, 则有Oula(l)个数 使得ord(a^那么大) = l成立
    -->定理: ord(a) = l, ord(a^辣么大) = l' --> l' = l / (那么大, l)

"""

# 原根

"""
设整数m>0, (g, m) = 1, 如果ord(g) = Oula(m), 则称g为模数m的一个原根

定理:
    设m>0, (g, m) = 1, 则g为模数m的一个原根的充要条件是g, g^2, g^3, ..., g^Oula(m)为模数m的一组既约剩余系
-->很难证明, 但是可以想象

定理:
    设p是一个奇素数, 则模p有一个原根

定理:
    整数m有原根的充要条件是:
        m = 2, 4, p^a, 2*p^a(a >= 1, p是奇素数)
    
"""

# 阶的计算方法

"""
    方法一:暴力解 遍历找1 见exp.py
    方法二:化大为小法
        讲m进行因式分解, 获得素数乘积, 记ord(下标pi ^ li)(a) = fi(i = 1, 2, ..., s)
        ord(a) = f, 则f = [f1, f2, f3, ..., fs]
    方法三:公式法
        设p是一个素数, a ̸= ±1, (a, p) = 1, ord(下标p^j)(a) = fj, 则fj+1 = fj 或 fj+1 = p*fj
        今天先到这里!
"""